interface Questions {
  id:string;
  word: string[];
  additional?:string[];
}

// By sk5s
const questions01:Questions[] = 
[{"id":"1","word":["蝴蝶","蜜蜂"]},{"id":"2","word":["電腦","筆電"]},{"id":"3","word":["歌仔戲","布袋戲"]},{"id":"4","word":["麻雀","烏鴉"]},{"id":"5","word":["眉毛","鬍鬚"]},{"id":"6","word":["狀元","冠軍"]},{"id":"7","word":["水餃","包子"]},{"id":"8","word":["端午節","中秋節"]},{"id":"9","word":["摩托車","汽車"]},{"id":"10","word":["高跟鞋","增高鞋"]},{"id":"11","word":["牛奶","豆漿"]},{"id":"12","word":["白菜","生菜"]},{"id":"13","word":["辣椒","芥末"]},{"id":"14","word":["金庸","古龍"],"additional":["武俠小說家，知名作品：《射鵰英雄傳》、《神鵰俠侶》、《倚天屠龍記》、《天龍八部》、《笑傲江湖》、《鹿鼎記》等","武俠小說家，知名作品：《楚留香傳奇》《絕代雙驕》《小李飛刀系列》《陸小鳳傳奇》等"]},{"id":"15","word":["海豚","海獅"]},{"id":"16","word":["臉盆","水桶"]},{"id":"17","word":["護脣膏","口紅"]},{"id":"18","word":["紙巾","手帕"]},{"id":"19","word":["首爾","東京"]},{"id":"20","word":["柳丁","橘子"]},{"id":"21","word":["太監","人妖"]},{"id":"22","word":["新年","跨年"]},{"id":"23","word":["吉他","琵琶"]},{"id":"24","word":["童話","神話"]},{"id":"25","word":["作家","編劇"]},{"id":"26","word":["結婚","訂婚"]},{"id":"27","word":["獎牌","金牌"]},{"id":"28","word":["麵包","蛋糕"]},{"id":"29","word":["作文","論文"]},{"id":"30","word":["枕頭","抱枕"]},{"id":"31","word":["手機","平板"]},{"id":"32","word":["婚紗","旗袍"]},{"id":"33","word":["魔術師","魔法師"]},{"id":"34","word":["鴨舌帽","漁夫帽"]},{"id":"35","word":["雙胞胎","龍鳳胎"],"additional":["","一男一女的雙胞胎"]},{"id":"36","word":["情人節","光棍節"]},{"id":"37","word":["醜小鴨","灰姑娘"]},{"id":"38","word":["富二代","高富帥"]},{"id":"39","word":["盆子","盤子"]},{"id":"40","word":["雞蛋","鴨蛋"]},{"id":"41","word":["七喜","雪碧"]},{"id":"42","word":["黑松沙士","蘋果西打"]},{"id":"43","word":["百事可樂","可口可樂"]},{"id":"44","word":["水杯","水壺"]},{"id":"45","word":["鬧鐘","時鐘"]},{"id":"46","word":["生活費","零用錢"]},{"id":"47","word":["麥克風","擴音器"]},{"id":"48","word":["圖書館","書店"]},{"id":"49","word":["洗衣粉","洗衣精"]},{"id":"50","word":["牛肉乾","豬肉乾"]},{"id":"51","word":["泡泡糖","棒棒糖"]},{"id":"52","word":["口香糖","木糖醇"],"additional":["","是一種可以作為蔗糖替代物的五碳糖醇"]},{"id":"53","word":["小籠包","芋頭包"]},{"id":"54","word":["薰衣草","滿天星"],"additional":["","為石竹科石頭花屬的植物"]},{"id":"55","word":["包青天","狄仁傑"],"additional":["曾任天章閣待制，以清廉公正聞名於世","為唐朝、武周時的著名宰相，剛正廉明，執法不阿"]},{"id":"56","word":["美粒果","每日C"]},{"id":"57","word":["沐浴乳","洗髮精"]},{"id":"58","word":["洗髮精","護髮乳"]},{"id":"59","word":["腳踏車","賽格威"],"additional":["","是一種電動的個人運輸載具，前傾即可向前進"]},{"id":"60","word":["班導師","輔導老師"]},{"id":"61","word":["雲霄飛車","碰碰車"]},{"id":"62","word":["鐵觀音","錫蘭紅茶"],"additional":["是烏龍茶的一種","是對出產於斯里蘭卡的紅茶的統稱"]},{"id":"63","word":["福爾摩斯","工藤新一"]},{"id":"64","word":["神鵰俠侶","天龍八部"],"additional":["金庸的武俠小說","金庸的武俠小說"]},{"id":"65","word":["勇往直前","全力以赴"]},{"id":"66","word":["麻婆豆腐","皮蛋豆腐"]},{"id":"67","word":["語無倫次","詞不達意"],"additional":["說話顛三倒四，毫無條理。","所用的言詞無法適切表達心意。"]},{"id":"68","word":["鼠目寸光","井底之蛙"],"additional":["形容人目光短淺，識見狹小。","比喻見識淺薄的人。"]},{"id":"69","word":["近視眼鏡","隱形眼鏡"]},{"id":"70","word":["老花眼鏡","放大鏡"]},{"id":"71","word":["降龍十八掌","九陰白骨爪"],"additional":["是金庸武俠小說中的上乘武功之一","是金庸武俠小說中的上乘武功之一"]},{"id":"72","word":["紅燒牛肉麵","豚骨拉麵"]},{"id":"73","word":["梁山伯與祝英臺","羅密歐與朱麗葉"]},{"id":"74","word":["iPhone","iPad"]},{"id":"75","word":["兩小無猜","青梅竹馬"],"additional":["稚齡男女，彼此天真無邪，毫無避嫌與猜疑。","比喻從小就相識的同伴。"]},{"id":"76","word":["時鐘","手錶"]},{"id":"77","word":["玉米","高粱"]},{"id":"78","word":["鉛球","鐵餅"]},{"id":"79","word":["散文","小說"]},{"id":"80","word":["菠蘿蜜","榴槤"]},{"id":"81","word":["買一送一","再來一瓶"]},{"id":"82","word":["初吻","初戀"]},{"id":"83","word":["臭豆腐","狗屎"]},{"id":"84","word":["鋼琴","電子琴"]},{"id":"85","word":["眼屎","鼻屎"]},{"id":"86","word":["飛彈","炸彈"]},{"id":"87","word":["花生","瓜子"]},{"id":"88","word":["人面獅身像","金字塔"],"additional":["是一座位於在卡夫拉金字塔旁的雕像",""]},{"id":"89","word":["奶牛","牛奶"]},{"id":"90","word":["人質","綁匪"]},{"id":"91","word":["鹽巴","味精"]},{"id":"92","word":["奇異果","水蜜桃"]},{"id":"93","word":["高鐵","臺鐵"]},{"id":"94","word":["吸血鬼","蚊子"]},{"id":"95","word":["名錶","跑車"]},{"id":"96","word":["攀岩","登山"]},{"id":"1686061485290","word":["龜毛","羽毛"]},{"id":"1686061485291","word":["小龍女","小籠包"]},{"id":"1686061485292","word":["芭蕾舞","鋼管舞"]},{"id":"1686061485293","word":["桌球拍","羽球拍"]}]

// By sk5s
const questions02:Questions[] = 
[{"id":"1686062161839","word":["臉頰","屁股"]},{"id":"1686062161840","word":["香水","尿"]},{"id":"1686062161841","word":["東京","京都"]}]

// By sk5s
// const questions03:Questions[] = 
// [{"id":"1686061485290","word":["龜毛","羽毛"]}]
// [{"id":"1686351853624","word":["字詞1","字詞2"],"additional":["1","2"]}]

export default function question(){
  return [...questions01,...questions02]
}
export function partialquestion(){
  return questions02
}